{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 100,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 100
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<start>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<end>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFKC"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<unk>": 1,
      "<start>": 2,
      "<end>": 3,
      "#": 4,
      "%": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      "-": 9,
      "/": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      "=": 21,
      "@": 22,
      "A": 23,
      "B": 24,
      "C": 25,
      "F": 26,
      "G": 27,
      "H": 28,
      "I": 29,
      "K": 30,
      "L": 31,
      "M": 32,
      "N": 33,
      "O": 34,
      "P": 35,
      "S": 36,
      "T": 37,
      "Z": 38,
      "[": 39,
      "\\": 40,
      "]": 41,
      "a": 42,
      "b": 43,
      "c": 44,
      "d": 45,
      "e": 46,
      "g": 47,
      "i": 48,
      "l": 49,
      "n": 50,
      "o": 51,
      "p": 52,
      "r": 53,
      "s": 54,
      "t": 55,
      "Ġ": 56,
      "cc": 57,
      "CC": 58,
      "(=": 59,
      "ccc": 60,
      "ĠC": 61,
      "OC": 62,
      "ĠCC": 63,
      "ccccc": 64,
      "@@": 65,
      ")[": 66,
      "](": 67,
      ")(": 68,
      "CCC": 69,
      "ĠO": 70,
      "Cl": 71,
      "CCCC": 72,
      "nc": 73,
      ")=": 74,
      "Oc": 75,
      "Br": 76,
      "Cc": 77,
      "12": 78,
      "cccc": 79,
      "-]": 80,
      "ĠCc": 81,
      "ĠCOc": 82,
      "CO": 83,
      "NC": 84,
      "+]": 85,
      "OCC": 86,
      "ĠCOC": 87,
      "nH": 88,
      "-])": 89,
      "(-": 90,
      "Nc": 91,
      "@]": 92,
      "+](=": 93,
      "([": 94,
      "@@]": 95,
      "21": 96,
      "ĠCCOC": 97,
      "oc": 98,
      ")/": 99
    },
    "merges": [
      [
        "c",
        "c"
      ],
      [
        "C",
        "C"
      ],
      [
        "(",
        "="
      ],
      [
        "cc",
        "c"
      ],
      [
        "Ġ",
        "C"
      ],
      [
        "O",
        "C"
      ],
      [
        "Ġ",
        "CC"
      ],
      [
        "cc",
        "ccc"
      ],
      [
        "@",
        "@"
      ],
      [
        ")",
        "["
      ],
      [
        "]",
        "("
      ],
      [
        ")",
        "("
      ],
      [
        "CC",
        "C"
      ],
      [
        "Ġ",
        "O"
      ],
      [
        "C",
        "l"
      ],
      [
        "CC",
        "CC"
      ],
      [
        "n",
        "c"
      ],
      [
        ")",
        "="
      ],
      [
        "O",
        "c"
      ],
      [
        "B",
        "r"
      ],
      [
        "C",
        "c"
      ],
      [
        "1",
        "2"
      ],
      [
        "cc",
        "cc"
      ],
      [
        "-",
        "]"
      ],
      [
        "ĠC",
        "c"
      ],
      [
        "ĠC",
        "Oc"
      ],
      [
        "C",
        "O"
      ],
      [
        "N",
        "C"
      ],
      [
        "+",
        "]"
      ],
      [
        "O",
        "CC"
      ],
      [
        "ĠC",
        "OC"
      ],
      [
        "n",
        "H"
      ],
      [
        "-]",
        ")"
      ],
      [
        "(",
        "-"
      ],
      [
        "N",
        "c"
      ],
      [
        "@",
        "]"
      ],
      [
        "+]",
        "(="
      ],
      [
        "(",
        "["
      ],
      [
        "@@",
        "]"
      ],
      [
        "2",
        "1"
      ],
      [
        "ĠCC",
        "OC"
      ],
      [
        "o",
        "c"
      ],
      [
        ")",
        "/"
      ]
    ]
  }
}